[
  {
    "title": "National Museum of Scotland",
    "slug": "national-museum-of-scotland",
    "thumbnail": "./images/nms-thumbnail.png",
    "logo": "./images/nms-logo.svg",
    "client": "City of Glasgow College",
    "gallery": [
      "./images/nms-logo-bg.png",
      "./images/nms-mock.png",
      "./images/nms-ticket.png"
    ],
    "services": ["Full Stack Development"],
    "technologies": [
      "React",
      "Styled Components",
      "NodeJS",
      "Express",
      "MongoDB"
    ],
    "links": {
      "site": "https://dm-national-museum-of-scotland.herokuapp.com",
      "github": "https://github.com/dylanmooney62/nms"
    },
    "caseStudy": {
      "brief": "This brief was a college project as the final graded unit. Ultimately the goal of this brief was to showcase what I had learned throughout my college experience.\n National Museums Scotland is an organisation that cares for the collections of national and international importance—preserving them, interpreting them, and making them accessible to as many people as possible.\nNational Museums Scotland were looking for a solution that engaged communities and wanted features that would help communities organise and arrange events.",
      "solution": "For the National Museums of Scotland, I produced a modern, responsive website with a crucial focus on rich imagery to engage customers and showcase the museums featured events.\n A search and filter system was created, which allowed curious users to search the numerous events the National Museum of Scotland and refine their search until they found a suitable event.\n A booking system was built to allow the National Museum of Scotland to sell tickets to patrons. This system was split into easy to digest linear stages, which enabled a seamless booking and helped users feel less overwhelmed. Payment processing was made simple for customers by utilising the Stripe API on the back-end to handle payments.\n The final step of the user experience was sending customers their unique ticket generated as a PDF directly to their email for them to print off for their visit to the museum.",
      "features": [
        "Responsive Design",
        "CRUD API",
        "Login System",
        "Payment Handling",
        "PDF Generation"
      ]
    }
  }
]
